Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Oder noch besser, anpacken und mithelfen.
pl: Albo jeszcze lepiej, samemu się nimi zająć i spróbować pomóc.

source: Oder noch schlimmer, deine aktuelle Sicherung ist in einem nicht lösbaren Stand, dann musst du von ganz vorne beginnen.
pl: Albo jeszcze gorzej, twój zabezpieczony stan utknął w miejsu nie do rozwiązania i musisz zaczynać wszystko od początku.

source: Oder rufe den fünftletzten 'Commit' ab, mit:
pl: Albo przywołaj 5 ostatnich 'commits' za pomocą:

source: Oder seit Gestern:
pl: Albo od wczoraj

source: Oder sie wollen zwei Spielstände vergleichen, um festzustellen wie viel ein Spieler geleistet hat.
pl: Albo chcecie porównać dwa stany, by sprawdzić ile jakiś gracz przyczynił się.

source: Oder zwischen irgendeiner Version und der vorvorletzten:
pl: Albo miedzy jakakolwiek wersja a przedostatnia:

source: Patches: Das globale Zahlungsmittel
pl: Patches: globalny środek płatniczy

source: Persönliche Erfahrungen
pl: Osobiste doświadczenia

source: Praktisch, http://csdcf.stanford.edu/status/[wenn dieser Server offline ist].
pl: Praktyczne, http://csdcf.stanford.edu/status/[gdyby ten serwer był offline].

source: Praktisch, wenn es keinen Strom gibt.
pl: Praktyczna, gdyby zabrakło prądu.

source: Prüfe, ob die 'filter-branch' Anweisung getan hat was du wolltest, dann lösche dieses Verzeichnis bevor du weitere 'filter-branch' Operationen durchführst.
pl: Sprawdź czy 'filter-branch' zrobił to, co od niego oczekiwałeś, następnie skasuj ten katalog zanim wykonasz następne polecenia 'filter-branch'.

source: Prüfe, ob diese Datei tatsächlich dem obigen Inhalt entspricht, durch Eingabe von:
pl: Sprawdź, czy plik na prawdę odpowiada powyższej zawartości przez polecenie:

source: Quellcode veröffentlichen
pl: Publikowanie kodu źródłowego

source: Rund ums 'Clonen'
pl: Polecenie CLONEN

source: Rückgängig machen
pl: Przywracanie

source: SHA1 Schwäche
pl: Słabości SHA1

source: Sagen wir du bist im `master` 'Branch'.
pl: Powiedzmy też, że znajdujesz sie w 'master branch'.

source: Sagen wir, du hast einen Haufen Dateien, die zusammen gehören, z.B. Quellcodes für ein Projekt oder Dateien einer Website.
pl: Powiedzmy, że posiadasz całą masę plików, które w jakiś sposób są ze sobą powiązane, na przykład kod źródłowy jakiegoś projektu lub pliki strony internetowej.

source: Schließlich, Teil I ist zugelassen:
pl: Wreszcie, dopuszczamy część I:

source: Schmutzarbeit
pl: Brudna robota

source: Schnelle Fehlerbehebung
pl: Szybkie poprawianie bledow.

source: Sei Vorsichtig, diese Art des '*Checkout*' kann Dateien überschreiben, ohne dass du etwas merkst.
pl: Bądź ostrożny, ten sposób wykonania komendy CHECKOUT może skasować pliki bez poinformowania o tym.

source: Sei auch vorsichtig, wenn Du +.git+ direkt manipulierst: was, wenn zeitgleich ein Git Kommando ausgeführt wird oder plötzlich der Strom ausfällt?
pl: Bądź też ostrożna przy bezpośredniej manipulacji +.giz+: gdy równocześnie wykonywane jest polecenie Git i zgaśnie światło?

source: Sei vorsichtig, wenn Du 'checkout' auf diese Weise benutzt.
pl: Bądź ostrożny stosując 'checkout' w ten sposób.

source: Sein Inhalt hängt von der 'Commit'-Beschreibung ab, wie auch vom Zeitpunkt der Erstellung.
pl: Jego zawartość jest zależna od opisu 'commit' jak i czasu jego wykonania.

source: Sicher, Du hast vielleicht *git mv* benutzt, aber das ist exakt das selbe wie *git rm* gefolgt von *git add*.
pl: Oczywiście, być może użyłaś polecenia *git mv*, jest to jednak to samo jakbyś użyła *git rm*, a następnie *git add*.

source: Sie alle haben bequeme Schnittstellen um Ordner voller Dateien zu verwalten.
pl: Wszystkie posiadają wygodne interfejsy, aby zarządzać katalogami pełnymi plików.

source: Sie müssen irgendwo gespeichert sein.
pl: Przecież muszą być gdzieś zapisane.

source: Siehe *git help branch*.
pl: Zobacz: *git help branch*.

source: Siehe *git help diff* und *git help rev-parse*.
pl: Sprawdź *git help diff* i *git help rev-parse*.

source: Siehe *git help filter-branch*, wo dieses Beispiel erklärt und eine schnellere Methode vorstellt wird.
pl: Sprawdź *git help filter-branch*, gdzie przykład ten został wytłumaczony i przytoczona została jeszcze szybsza metoda.

source: Siehe *git help ignore* um zu sehen, wie man Dateien definiert, die ignoriert werden sollen.
pl: Sprawdź też *git help ignore*, by dowiedzieć się jak zdefiniować dane, króre powinny być ignorowane.

source: Siehe *git help remote* um zu sehen wie man Remote-'Repositories' entfernt, bestimmte 'Branches' ignoriert und mehr.
pl: Sprawdź *git help remote* by zobaczyć, jak usuwa się repozytoria, ignoruje pewne branches i więcej-

source: Siehe *git help stash*.
pl: Zobacz *git help stash*.

source: Siehe auch *git help rebase* für ausführliche Beispiele dieser erstaunlichen Anweisung.
pl: Przeczytaj też *git help rebase* dla zapoznania sie z obszernymi przykładami tej zadziwiającej funkcji.

source: Siehe auf der Git Hilfeseite für einige Anwendungsbeispiele.
pl: Na stronach pomocy git znajdziesz więcej zasosowań.

source: Siehe http://torvalds-family.blogspot.com/2009/06/happiness-is-warm-scm.html[diesen Blog Beitrag von Linus Torvalds (englisch)].
pl: Zobacz http://torvalds-family.blogspot.com/2009/06/happiness-is-warm-scm.html[Post na Blogu Linusa Torvalds (po angielsku)].

source: Siehe in der ``Specifying Revisions'' Sektion von *git help rev-parse* für mehr.
pl: Jeśli chciałbyś pogłębić wiedze na ten temat przeczytaj sekcję ``specifying revisions`` w *git help rev-parse*.

source: So konnte ich einfach vorhersagen, was Du sehen wirst.
pl: Przez to właśnie mogłem 'przepowiedzieć' wynik.

source: So schwierig zu lösen, dass viele erfahrene Spieler auf der ganzen Welt beschließen sich zusammen zu tun und ihre gespeicherten Spielstände auszutauschen um das Spiel zu beenden.
pl: Tak trudną, że wielu doświadczonych graczy na całym świecie postanawia o współnych siłach przejść grę, wymieniając się w tym celu swoimi zapamiętanymi wynikami.

source: So wie Nationen ewig diskutieren, wer welche Greueltaten vollbracht hat, wirst du beim Abgleichen in Schwierigkeiten geraten, falls jemand einen 'Clone' mit abweichender Chronik hat und die Zweige sich austauschen sollen.
pl: Tak samo jak Narody ciągle dyskutują, który jakie popełnił okrucieństwa, popadniesz w kłopoty przy synchronizacji, jeśli ktoś inny posiada klon z różniącą się historią i jeśli te odgałęzienia mają sie wymieniać.

source: Sogar einige Git Anweisungen selbst sind nur winzige Skripte, wie Zwerge auf den Schultern von Riesen.
pl: Nawek same polecenia git są czasami malutkimi skryptami, jak krasnoludki na ramieniu olbrzyma.

source: Sogar mehr als das: jegliche Zeichenfolge, die alle Menschen über mehrere Generationen verwenden.
pl: Nawet i więcej niż to: wszystkie łańcuchy znaków, jakie ludzkość przez wiele generacji stworzyła.

source: Solange Deine Mitstreiter ihre eMails lesen können, können sie auch Deine Änderungen sehen.
pl: Doputy twoi współpracownicy potrafią czytać swoje maile, mogą widzieć również twoje zmiany.

source: Solltest du kürzlich konkurrierende Änderungen an der selben Datei vorgenommen haben, lässt Git dich das wissen und musst erneut 'commiten' nachdem du die Konflikte aufgelöst hast.
pl: Jeśli dokonałeś zmian na tej samej danej na obydwóch komputerach, GIT cię o tym poinformuje, po usunięciu konfliktu musidz ponownie COMMITEN

source: Speichere und Beende.
pl: Zapamietaj i zakończ.

source: Später wollte ich meinen Code mit Git veröffentlichen und Änderungen von Mitstreitern einbinden.
pl: Później chciałem opublikować mój kod za pomocą git i dołączyć zmiany kolegów

source: Stand sichern
pl: Backup

source: Standardmäßig beginnst du in einem 'Branch' namens ``master''.
pl: Standardowo zaczynasz w BRANCH zwanym MASTER.

source: Standardmäßig behält Git einen 'Commit' für mindesten zwei Wochen, sogar wenn Du Git anweist den 'Branch' zu zerstören, in dem er enthalten ist.
pl: Standardowo GIT zapamiętuje 'commit' przez przynajmniej 2 tygodnie, nawet jeśli poleciłeś zniszczyć 'branch' w którym istniał.

source: Standardmäßig bleiben die Daten mindestens zwei Wochen erhalten.
pl: Standardowo dane te pozostają jeszcze przez 2 tygodnie.

source: Standardmäßig nutzt Git Systemeinstellungen um diese Felder auszufüllen.
pl: Standardowo git korzysta z ustawień systemowych do wypełnienia tych pól.

source: Stattdessen stellen wir uns wieder vor, wir editieren ein Dokument.
pl: Zamiast tego wyobraźmy sobie znowu, że edytujemy jakiś dokument.

source: Stell Dir vor, jemand will den Inhalt einer Datei ändern, die in einer älteren Version eines Projekt liegt.
pl: Wyobraź sobie,, ktoś ma zamiar zmienić treść jakiegoś pliku, która leży w jakiejś starszej wersji projektu.

source: Stell dir vor, Alice fügt eine Zeile am Dateianfang hinzu und Bob eine am Dateiende.
pl: Wyobraź sobie, Alicja dodaje linijkę na początku dokunentu, natomiast Bob na jego końcu.

source: Stell dir zum Beispiel vor, du willst ein Projekt veröffentlichen, aber es enthält eine Datei, die aus irgendwelchen Gründen privat bleiben muss.
pl: Wyobraź sobie, że chcesz opublikować projekt, jednak zawiera on pewny plik, który z jakiegoś powodu musi pozostać prywatnym.

source: Stelle dir das Bearbeiten deines Codes oder deiner Dokumente wie ein Computerspiel vor.
pl: Wyobraź sobie pracę nad twoim kodem albo dokumentami jak granie na komputerze.

source: Stimmen diese Daten überein, kann Git das Lesen des Dateiinhalts überspringen.
pl: Jeśli dane te nie różnią się, Git może pominąć czytanie zawartości pliku.

source: Subversion, vielleicht das beste zentralisierte Versionsverwaltungssystem, wird von unzähligen Projekten benutzt.
pl: Subversion, być może najlepszy z centralnych systemów, stosowany jest w wielu projektach.

source: Suche Dir einen Dateinamen aus, irgendeinen.
pl: Wymyśl jakąś nazwę pliku, jakąkolwiek.

source: Tatsächlich beschreibt dies die früheste Version von Git.
pl: W sumie można by tak opisać najwcześniejsze wersje Gita.

source: Tatsächlich sind wir dem 'Mergen' schon lange begegnet.
pl: W gruncie rzeczy spotkalismy sie juz wczesniej z 'merge'.

source: Temporäre 'Branches'
pl: Tymczasowe BRANCHES

source: Teste die Funktion und wenn sich immer noch nicht funktioniert:
pl: Przetestuj funkcję, a jeśli ciągle jeszcze nie funkcjonuje:

source: Tippe:
pl: Wpisz:

source: Trotz ihrer Einfachheit, sind alle davon wichtig und nützlich.
pl: Momo ich prostoty, wszystkie sa wazne i pozyteczne.

source: Trotz seiner Größe, +einedatei+ enthält das komplette original Git 'Repository'.
pl: Mimo swojej wielkości +plik+ zawiera kompletny orginał repozytorium.

source: Trotzdem gibt es Situationen, in denen es besser ist einen oberflächlichen Klon mit der `--depth` Option zu erstellen.
pl: Niemniej jednak istnieją sytuacje, w których lepiej utworzyć powierzchowny klon korzystając z opcji `--depth`.

source: Trotzdem kann es langwierig sein, den exakten Befehl zur Lösung einer bestimmten Aufgabe herauszufinden.
pl: Mimo to może okazać się dość mozolne odnalezienie odpowiedniej komendy dla rozwiązania pewnych zadań.

source: Trotzdem kann jedermann die Quelltexte einsehen, durch Eingabe von:
pl: Mimo to każdy może otrzymać kod źródłowy poprzez podanie:

source: Ultimative Datensicherung
pl: Ultymatywny backup danych

source: Um Dateien zu bekommen, erstellst du einen 'Clone' des gesamten 'Repository'.
pl: By pozyskać dane, tworzysz klon całej REPOSITORY.

source: Um Unfälle zu vermeiden solltest du immer 'commiten' bevor du ein 'Checkout' machst, besonders am Anfang wenn du Git noch erlernst.
pl: Aby zabezpieczyc sie przed takimi wypadkami powinieneś zawsze wykonać polecenie COMMIT zanim wykonasz CHECKOUT, szczególnie ucząc się jeszcze pracy z GIT,

source: Um auf die aktuelle Server-Version zu aktualisieren:
pl: Aby zaktualizować do wersji na serwerze:

source: Um das Leben zu vereinfachen, könnte jemand ein Skript erstellen, das Git benutzt um den Quellcode zu klonen und 'rsync' oder einen oberflächlichen Klon für die Firmware.
pl: By ułatwić sobie życie, ktoś mógłby opracować skrypt, który Git wykorzystuje do klonowania kodu źródłowego i 'rsync' albo pobieżny klon dla samego firmware.

source: Um das Löschen zu erzwingen, gib ein:
pl: By wymusić skasowanie, podaj:

source: Um das Verschieben zu erzwingen, gib ein:
pl: By wymusić przesunięcie, podaj:

source: Um das zu tun, klickst du auf auf Speichern in deinem vertrauten Editor.
pl: W tym celu klikasz na 'zapisz' w wybranym edytorze.

source: Um den neuen Stand zu sichern:
pl: Aby zapisac nowy stan:

source: Um die Objektdatenbank intakt aussehen zu lassen, müssten sie außerdem den SHA1-Hash-Wert des korrespondierenden 'Blob'-Objekt ändern, da die Datei nun eine geänderte Zeichenfolge enthält.
pl: By sprawić pozory, że baza danych wygląda nienaruszona. musiałabyś wmienić klucze SHA1 korespondujących objektów, ponieważ plik zawiera teraz zmieniony sznur znaków.

source: Um die Quellcodes abzurufen gibt ein Entwickler folgendes ein:
pl: By pozyskać kod źródłowy programista podaje zwykle polecenie tego rodzaju:

source: Um die lokalen Änderungen in das zentrale 'Repository' zu übertragen:
pl: Lokalne zmiany przekazujemy do serwera poleceniem:

source: Um dies in Git zu tun, gehe ins Verzeichnis in dem das Skript liegt:
pl: Aby wykonać to za pomocą GIT, wejdź do katalogu w którym znajduje się twój skrypt:

source: Um diese Angaben explizit zu setzen, gib ein:
pl: Aby wprowadzić te dane bezpośrednio, podaj:

source: Um ehrlich zu sein, meine ersten Monate mit Git brauchte ich nicht mehr als in diesem Kapitel beschrieben steht.
pl: Bedac szczery, w pierwszych miesiacach pracy z GIT nie potrzebowalem zadnych innych poleceń, niz opisane w tym rozdziale

source: Um ein tarball-Archiv des Quellcodes zu erzeugen, verwende ich den Befehl:
pl: Aby utworzyć archiwum tar kodu źródłowego, używam polecenia

source: Um es zu erzwingen, verwende:
pl: By zmusić dgo do tego, możesz użyć:

source: Um mir die Geschichte eines 'Repositories' anzuzeigen benutze ich häufig http://sourceforge.net/projects/qgit[qgit] da es eine schicke Benutzeroberfläche hat, oder http://jonas.nitro.dk/tig/[tig], eine Konsolenanwendung, die sehr gut über langsame Verbindungen funktioniert.
pl: Jesli chce sprawdzic historie jakiegos REPOSITORY korzystam czesto z XXXX, poniewaz posiada przyjazny interfejs uzytkownika, albo XXXX, program konsolowy, ktory bardzo dobrze dziala jesli mamy do czynienia z powolnymi laczami interenetowymi.

source: Um trotzdem die Änderungen zu zerstören und einen vorhandenen 'Commit' abzurufen, benutzen wir die 'force' Option:
pl: Aby mimo tego zniszczyć zmiany i przywołać istniejący 'commit', możemy skorzystać z opcji 'force':

source: Um wieder die Computerspielanalogie anzuwenden:
pl: Jeśli znów skorzystamy z analogii do gier komputerkowych:

source: Um zu ermitteln, ob eine Datei verändert wurde, vergleicht Git den aktuellen Status mit dem im Index gespeicherten.
pl: By ustalić, czy nastąpiła jakaś zmiana, Git porównuje stan aktualny ze stanem zapamiętanym w indeksie.

source: Um zu verhindern, dass sich Git beschwert, solltest du vor einem 'Checkout' alle Änderungen 'commiten' oder 'reseten'.
pl: Aby zapobiec by GIT sie stawiał, powinieneś przed każdym CHECKOUT wszystkie zmiany COMMITEN albo RESETEN

source: Um zum Beispiel alle Dateien zu bekommen, die ich zum Erzeugen dieser Seiten benutze:
pl: By na przykład zładować wszystkie dane, których urzyłem do stworzenia tej strony skorzystaj z:

source: Um zum Beispiel die Anleitung auf http://de.wikipedia.org/wiki/Klingonische_Sprache[Klingonisch] zu übersetzen, mußt du folgendes machen:
pl: Aby przykładowo przetłumaczyć to HOWTO na http://de.wikipedia.org/wiki/Klingonische_Sprache[Klingonisch], musisz wykonać następujące polecenia:

source: Um zum Beispiel die Logs vom zweiten Elternteil anzuzeigen:
pl: By na przyklad pokazać logi drugiego rodzica

source: Um zum Beispiel die Unterschiede zum ersten Elternteil anzuzeigen:
pl: Natomiast, by pokazać roznice do pierwszgo rodzica

source: Unbeständige Projekte
pl: Niestałe projekty

source: Und das ist, wenn Du froh bist, dass Git die ganze Zeit über Dich gewacht hat.
pl: A oto chodzi, byś był zadoowolony z tego, że Git cały czas czuwa nad twoją pracą

source: Und eigene Sicherungen bereitstellt?
pl: Natomiast własne innym udostępni?

source: Und wenn der Chef in diesem Verzeichnis herumschnüffelt, tippe:
pl: A gdy szef grzebie w twoim katalogu, wpisz:

source: Unsichtbarkeit
pl: Niewidzialność

source: Unter den Befehlen im Zusammenhang mit Git's verteilter Art, brauchte ich nur *pull* und *clone*, damit konnte ich das selbe Projekt an unterschiedlichen Orten halten.
pl: Z poleceń w związku z rozproszoną naturą git, potrzebowałem jedynie poleceń *pull* i *clone*, dzięki czemu mogłem trzymać ten sam projekt w kilku miejscach.

source: Unterschiede sind schnell gefunden, weil nur die markierten Dateien untersucht werden müssen.
pl: Różnice zostają szybko znalezione, ponieważ wystarczy skontrolować wyłącznie zaznaczone dane

source: Untracked .txt files.
pl: untracket.txt files.

source: Unverzügliches 'Branchen' und 'Mergen' sind die hervorstechenden Eigenschaften von Git.
pl: niezwloczne 'branch' i MERGEN sa uderzajacymi wlasciwosciami GIT

source: Verhindere schlechte 'Commits'
pl: Zapobiegaj złym 'commits'

source: Verliere nicht Deinen KOPF
pl: Nie trać głowy

source: Verschiedene Git Hosting Anbieter lassen Dich mit einem Klick deine eigene 'Fork' eines Projekts hosten.
pl: Większość hosterów Gita pozwala na utworzenie jednym kliknięciem twojego własnego forka innego projektu.

source: Verschiedene Projekte benötigen ein http://de.wikipedia.org/wiki/%C3%84nderungsprotokoll[Änderungsprotokoll].
pl: Niektóre projekty wymagają pliku historii zmian

source: Verschiedene Versionsverwaltungssysteme unterhalten einen Zähler, der mit jedem 'Commit' erhöht wird.
pl: Wiele systemów kontroli wersji udostępnia licznik, który jest zwiększany z każdym "commit".

source: Versionsverwaltung
pl: Kontrola wersji

source: Versionsverwaltung im Untergrund
pl: Zarządzanie wersją w poddziemiu

source: Versionsverwaltungen sind nicht anders.
pl: Systemy kontroli wersji nie różnią się tutaj zbytnio.

source: Versionsverwaltungssysteme behandeln die einfacheren Fälle selbst und überlassen die schwierigen uns Menschen.
pl: Systemy kontroli wersji potrafią poradzić sobie z prostymi przypadkami a te trudniejsze pozostawiają ludziom.

source: Versuche
pl: Wypróbuj polecenie:

source: Versuche Kopien Deiner Datei hinzuzufügen, mit beliebigen Dateinamen.
pl: Spróbuj dodać kopie twojej danej pod jakąkolwiek nazwą.

source: Versuche auch:
pl: Sprobuj rowniez:

source: Verteilte Kontrolle
pl: Rozproszona kontrola

source: Viele Git Befehle funktionieren nicht in 'bare Repositories'.
pl: Wiele z poleceń GIT nie funkcjonuje na BARE REPOSITORIACH

source: Viele Git Operationen unterstützen 'hooks'; siehe *git help hooks*.
pl: Wiele z operacji git pozwala na używanie 'hooks'; zobacz też: *git help hooks*.

source: Viele Kommandos sind mürrisch vor dem intialen 'Commit'.
pl: Wiele komend zachowuje sie zgrzędliwie przed wykonaniem pierwszego 'commit'.

source: Viele Versionen auf diese Art zu archivieren ist mühselig und kann sehr schnell teuer werden.
pl: Archiwizowanie w ten sposób wielu wersji jest pracochłonne i szybko może stać się kosztowne.

source: Vielen Dank an alle diese Seiten für das Hosten dieser Anleitung.
pl: Duże dzięki dla wszystkich tych stron za hosting tego poradnika.

source: Vielleicht habe ich meine Kreditkartennummer in einer Textdatei notiert und diese versehentlich dem Projekt hinzugefügt.
pl: Być może zapisałem numer karty kredytowej w danej tekstowej i nieumyślnie dodałem do projektu?

source: Vielleicht hast Du gerade bemerkt, dass Du einen kapitalen Fehler gemacht hast und nun musst Du zu einem uralten 'Commit' in einem länst vergessenen 'Branch' zurück.
pl: Może właśnie spostrzegłeś, iż dokonałeś kapitalnego błędu i musisz wrócić się do przestarego 'commit' w zapomnianym 'branch'.

source: Vielleicht in Form eines 'Tags', der mit dem SHA1-Hash des letzten 'Commit' verknüpft ist.
pl: Może jako forma taga, który powiązany jest z hashem SHA1 ostatniego 'commit'.

source: Vielleicht ist der aktuell gesicherte Spielstand nicht mehr lösbar, weil jemand in der dritten Ebene vergessen hat ein Objekt aufzunehmen und sie versuchen den letzten Spielstand zu finden, ab dem das Spiel wieder lösbar ist.
pl: Może aktualnie zapamiętany stan gry nie jest do przejścia, bo ktoś na trzecim poziomie zapomniał zabrać jakiś objekt, i teraz próbują znaleźć stan startując od którego gra staje się znowu możliwa do przejścia.

source: Vielleicht ist eher eine Datenbank oder Sicherungs-/Archivierungslösung gesucht, nicht ein Versionsverwaltungssystem.
pl: Może czasami bardziej wskazana byłaby baza danych, czy jakiś system archiwizacji zamiast systemu kontroli wersji.

source: Vielleicht kann ich Dir etwas Zeit sparen: Nachfolgend findest Du ein paar Rezepte, die ich in der Vergangenheit gebraucht habe.
pl: Może uda mi się zaoszczędzić tobie trochę czasu: poniżej znajdziesz kilka recept, które były mi przydatne w przeszłości.

source: Vielleicht können Dateiformate geändert werden.
pl: Ewentualnie można czasami zmienić format danych.

source: Vielleicht magst du es, alle Aspekte eines Projekts im selben 'Branch' abzuarbeiten.
pl: Może lubisz odpracować wszystkie aspekty projektu w

source: Vielleicht möchtest Du eine längere Gnadenfrist für todgeweihte 'Commits' konfigurieren.
pl: Byś może zechcesz zmienić czas łaski dla pogrzebanych 'commits'.

source: Vielmehr kann es sogar Codeblöcke erkennen, die zwischen Dateien hin und her kopiert oder verschoben wurden!
pl: Dodatkowo potrafi czasami nawet znaleźć całe bloki z kodem przenoszonym tam i spowrotem między plikami!

source: Vielmehr schreibt Git die Daten zuerst in den Index, danach kopiert es die Daten aus dem Index an ihren eigentlichen Bestimmungsort.
pl: Raczej zapisuje on dane najżierw w indexie, dopiero po tym kopiuje dane z indexu na ich właściwe miejsce przeznaczenia.

source: Von Magie nicht zu unterscheiden
pl: Nie do odróżnienia od magii

source: Von jetzt an wird
pl: Od teraz poleceniem:

source: Vorwort
pl: Przedmowa

source: Wann immer du zu deiner Schmutzarbeit zurückkehren willst, tippe einfach:
pl: Jesli tylko chcesz wrocic do twojej brudnej roboty, wpisz po prostu

source: Warum haben wir den 'push'-Befehl eingeführt, anstatt bei dem vertrauten 'pull'-Befehl zu bleiben?
pl: Dlaczego wprowadziliśmy polecenie PUSH, i nie pozostaliśmy przy znanym nam już PULL?

source: Warum ich Git benutze
pl: Dlaczego korzystam z GIT

source: Warum kann ein Haufen von Dateistatusinformationen ein Bereitstellungsraum sein?
pl: Jak to możliwe, że stos informacji o statusie danych może być przechowywalnią?

source: Warum mehrere Tabs unterstützen und mehrere Fenster?
pl: Dlaczego pozwalają używać tabs albo okien?

source: Was habe ich getan?
pl: Co ostatnio robilem?

source: Was ist mit Git's berühmten Fähigkeiten?
pl: A co ze sławnymi możliwościami Gita?

source: Was ist, wenn Du viele Dateien an verschiedenen Orten bearbeitet hast?
pl: A co, jeśli pracowałeś nad wieloma danymi w wielu różnych miejscach?

source: Was, wenn du am Ende die temporären Änderungen sichern willst?
pl: A co jesli chcesz zapamietac wprowadzone zmiany?

source: Was, wenn ein Spieler aus irgendeinem Grund einen alten Spielstand will?
pl: A gdy jakiś gracz z jakiegoś powodu chce otrzymać jakiś starszy stan?

source: Weil beides zu erlauben eine Vielzahl an Stilen unterstützt.
pl: Ponieważ udostępnienie obu możliwości pozwala na stosowanie wielu stylów.

source: Weil der SHA1-Hash-Wert von:
pl: Poniewaś wartość klucza SHA1 dla:
